import numpy as np



idx2chinese_place = {
    0: "浙江大学紫金港校区",
    1: "西湖",
    2: "宋城",
    3: "河坊街",
    4: "西溪国家湿地公园",
    5: "千岛湖风景区",
    6: "湘湖度假区",
    7: "浙江省博物馆",
    8: "浙江省美术馆",
    9: "中国丝绸博物馆",
    10: "杭州市植物园",
}

chinese_place2idx = {
    "浙江大学紫金港校区":    0,
    "西湖":               1,
    "宋城":               2,
    "河坊街":              3,
    "西溪国家湿地公园":      4,
    "千岛湖风景区":         5,
    "湘湖度假区":          6,
    "浙江省博物馆":         7,
    "浙江省美术馆":         8,
    "中国丝绸博物馆":       9,
    "杭州市植物园":         10,
}

idx2english_place = {
    0: "zju",
    1: "west_lake",
    2: "sc",
    3: "hfj",
    4: "xixi",
    5: "qdh",
    6: "xianghu",
    7: "zj_museum",
    8: "zj_art_museum",
    9: "silk_museum",
    10: "hz_plant",
}

english_place2idx = {
    "zju": 0,
    "west_lake": 1,
    "sc": 2,
    "hfj": 3,
    "xixi": 4,
    "qdh": 5,
    "xianghu": 6,
    "zj_museum": 7,
    "zj_art_museum": 8,
    "silk_museum": 9,
    "hz_plant": 10,
}

adj = [
    [0,9.4,17,14,8.4,175,40,11,15,14,9.6],
    [9.4,0,14,3,12,166,21,4.2,4.4,4.6,5.1],
    [17,14,0,13,17,158,22,14,11,10,13],
    [14,3,13,0,16,163,17,7,2.6,3.5,8.6],
    [8.4,12,17,16,0,167,38,12,14,15,11],
    [175,166,158,163,167,0,170,189,168,174,190],
    [40,21,22,17,38,170,0,22,15,16,21],
    [11,4.2,14,7,12,189,22,0,6.6,7.2,2.2],
    [15,4.4,11,2.6,14,168,15,6.6,0,0.989,6],
    [14,4.6,10,3.5,15,174,16,7.2,0.989,0,6.7],
    [9.6,5.1,13,8.6,11,190,21,2.2,6,6.7,0],
]

adj = np.array(adj, dtype=np.float)
# print(adj)
# print(idx2chinese_place)
# print(chinese_place2idx)